bantamtools/g2_chabo_public/src/packs/ATSAMS70N20B_DFP/component/usbhs.h
#define USBHS_HSTPIPIMR2_REG_OFST      (0x5C8)             /**< (USBHS_HSTPIPIMR2) Host Pipe Mask Register Offset */
#define USBHS_HSTPIPIMR3_REG_OFST      (0x5CC)             /**< (USBHS_HSTPIPIMR3) Host Pipe Mask Register Offset */
#define USBHS_HSTPIPIMR4_REG_OFST      (0x5D0)             /**< (USBHS_HSTPIPIMR4) Host Pipe Mask Register Offset */
#define USBHS_HSTPIPIMR5_REG_OFST      (0x5D4)             /**< (USBHS_HSTPIPIMR5) Host Pipe Mask Register Offset */
#define USBHS_HSTPIPIMR6_REG_OFST      (0x5D8)             /**< (USBHS_HSTPIPIMR6) Host Pipe Mask Register Offset */
#define USBHS_HSTPIPIMR7_REG_OFST      (0x5DC)             /**< (USBHS_HSTPIPIMR7) Host Pipe Mask Register Offset */
#define USBHS_HSTPIPIMR8_REG_OFST      (0x5E0)             /**< (USBHS_HSTPIPIMR8) Host Pipe Mask Register Offset */
#define USBHS_HSTPIPIMR9_REG_OFST      (0x5E4)             /**< (USBHS_HSTPIPIMR9) Host Pipe Mask Register Offset */
#define USBHS_HSTPIPIER_REG_OFST       (0x5F0)             /**< (USBHS_HSTPIPIER) Host Pipe Enable Register Offset */
#define USBHS_HSTPIPIER0_REG_OFST      (0x5F0)             /**< (USBHS_HSTPIPIER0) Host Pipe Enable Register Offset */
#define USBHS_HSTPIPIER1_REG_OFST      (0x5F4)             /**< (USBHS_HSTPIPIER1) Host Pipe Enable Register Offset */
#define USBHS_HSTPIPIER2_REG_OFST      (0x5F8)             /**< (USBHS_HSTPIPIER2) Host Pipe Enable Register Offset */
#define USBHS_HSTPIPIER3_REG_OFST      (0x5FC)             /**< (USBHS_HSTPIPIER3) Host Pipe Enable Register Offset */
#define USBHS_HSTPIPIER4_REG_OFST      (0x600)             /**< (USBHS_HSTPIPIER4) Host Pipe Enable Register Offset */
#define USBHS_HSTPIPIER5_REG_OFST      (0x604)             /**< (USBHS_HSTPIPIER5) Host Pipe Enable Register Offset */
#define USBHS_HSTPIPIER6_REG_OFST      (0x608)             /**< (USBHS_HSTPIPIER6) Host Pipe Enable Register Offset */
#define USBHS_HSTPIPIER7_REG_OFST      (0x60C)             /**< (USBHS_HSTPIPIER7) Host Pipe Enable Register Offset */
#define USBHS_HSTPIPIER8_REG_OFST      (0x610)             /**< (USBHS_HSTPIPIER8) Host Pipe Enable Register Offset */
#define USBHS_HSTPIPIER9_REG_OFST      (0x614)             /**< (USBHS_HSTPIPIER9) Host Pipe Enable Register Offset */
#define USBHS_HSTPIPIDR_REG_OFST       (0x620)             /**< (USBHS_HSTPIPIDR) Host Pipe Disable Register Offset */
#define USBHS_HSTPIPIDR0_REG_OFST      (0x620)             /**< (USBHS_HSTPIPIDR0) Host Pipe Disable Register Offset */
#define USBHS_HSTPIPIDR1_REG_OFST      (0x624)             /**< (USBHS_HSTPIPIDR1) Host Pipe Disable Register Offset */
#define USBHS_HSTPIPIDR2_REG_OFST      (0x628)             /**< (USBHS_HSTPIPIDR2) Host Pipe Disable Register Offset */
#define USBHS_HSTPIPIDR3_REG_OFST      (0x62C)             /**< (USBHS_HSTPIPIDR3) Host Pipe Disable Register Offset */
#define USBHS_HSTPIPIDR4_REG_OFST      (0x630)             /**< (USBHS_HSTPIPIDR4) Host Pipe Disable Register Offset */
#define USBHS_HSTPIPIDR5_REG_OFST      (0x634)             /**< (USBHS_HSTPIPIDR5) Host Pipe Disable Register Offset */
#define USBHS_HSTPIPIDR6_REG_OFST      (0x638)             /**< (USBHS_HSTPIPIDR6) Host Pipe Disable Register Offset */
#define USBHS_HSTPIPIDR7_REG_OFST      (0x63C)             /**< (USBHS_HSTPIPIDR7) Host Pipe Disable Register Offset */
#define USBHS_HSTPIPIDR8_REG_OFST      (0x640)             /**< (USBHS_HSTPIPIDR8) Host Pipe Disable Register Offset */
#define USBHS_HSTPIPIDR9_REG_OFST      (0x644)             /**< (USBHS_HSTPIPIDR9) Host Pipe Disable Register Offset */
#define USBHS_HSTPIPINRQ_REG_OFST      (0x650)             /**< (USBHS_HSTPIPINRQ) Host Pipe IN Request Register Offset */
#define USBHS_HSTPIPINRQ0_REG_OFST     (0x650)             /**< (USBHS_HSTPIPINRQ0) Host Pipe IN Request Register Offset */
#define USBHS_HSTPIPINRQ1_REG_OFST     (0x654)             /**< (USBHS_HSTPIPINRQ1) Host Pipe IN Request Register Offset */
#define USBHS_HSTPIPINRQ2_REG_OFST     (0x658)             /**< (USBHS_HSTPIPINRQ2) Host Pipe IN Request Register Offset */
#define USBHS_HSTPIPINRQ3_REG_OFST     (0x65C)             /**< (USBHS_HSTPIPINRQ3) Host Pipe IN Request Register Offset */
#define USBHS_HSTPIPINRQ4_REG_OFST     (0x660)             /**< (USBHS_HSTPIPINRQ4) Host Pipe IN Request Register Offset */
#define USBHS_HSTPIPINRQ5_REG_OFST     (0x664)             /**< (USBHS_HSTPIPINRQ5) Host Pipe IN Request Register Offset */
#define USBHS_HSTPIPINRQ6_REG_OFST     (0x668)             /**< (USBHS_HSTPIPINRQ6) Host Pipe IN Request Register Offset */
#define USBHS_HSTPIPINRQ7_REG_OFST     (0x66C)             /**< (USBHS_HSTPIPINRQ7) Host Pipe IN Request Register Offset */
#define USBHS_HSTPIPINRQ8_REG_OFST     (0x670)             /**< (USBHS_HSTPIPINRQ8) Host Pipe IN Request Register Offset */
#define USBHS_HSTPIPINRQ9_REG_OFST     (0x674)             /**< (USBHS_HSTPIPINRQ9) Host Pipe IN Request Register Offset */
#define USBHS_HSTPIPERR_REG_OFST       (0x680)             /**< (USBHS_HSTPIPERR) Host Pipe Error Register Offset */
#define USBHS_HSTPIPERR0_REG_OFST      (0x680)             /**< (USBHS_HSTPIPERR0) Host Pipe Error Register Offset */
#define USBHS_HSTPIPERR1_REG_OFST      (0x684)             /**< (USBHS_HSTPIPERR1) Host Pipe Error Register Offset */
#define USBHS_HSTPIPERR2_REG_OFST      (0x688)             /**< (USBHS_HSTPIPERR2) Host Pipe Error Register Offset */
#define USBHS_HSTPIPERR3_REG_OFST      (0x68C)             /**< (USBHS_HSTPIPERR3) Host Pipe Error Register Offset */
#define USBHS_HSTPIPERR4_REG_OFST      (0x690)             /**< (USBHS_HSTPIPERR4) Host Pipe Error Register Offset */
#define USBHS_HSTPIPERR5_REG_OFST      (0x694)             /**< (USBHS_HSTPIPERR5) Host Pipe Error Register Offset */
#define USBHS_HSTPIPERR6_REG_OFST      (0x698)             /**< (USBHS_HSTPIPERR6) Host Pipe Error Register Offset */
#define USBHS_HSTPIPERR7_REG_OFST      (0x69C)             /**< (USBHS_HSTPIPERR7) Host Pipe Error Register Offset */
#define USBHS_HSTPIPERR8_REG_OFST      (0x6A0)             /**< (USBHS_HSTPIPERR8) Host Pipe Error Register Offset */
#define USBHS_HSTPIPERR9_REG_OFST      (0x6A4)             /**< (USBHS_HSTPIPERR9) Host Pipe Error Register Offset */
#define USBHS_CTRL_REG_OFST            (0x800)             /**< (USBHS_CTRL) General Control Register Offset */
#define USBHS_SR_REG_OFST              (0x804)             /**< (USBHS_SR) General Status Register Offset */
#define USBHS_SCR_REG_OFST             (0x808)             /**< (USBHS_SCR) General Status Clear Register Offset */
#define USBHS_SFR_REG_OFST             (0x80C)             /**< (USBHS_SFR) General Status Set Register Offset */

